import sqlite3

def create_db():
    conn = sqlite3.connect('visi.db')
    cursor = conn.cursor()

    cursor.execute("""CREATE TABLE  IF NOT EXISTS nems (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        slovo TEXT NOT NULL,
        category TEXT NOT NULL)
    """)

    words = [
        ("ПИТОН", "Языки программирования"),
        ("ДЖАНГО", "Языки программирования"),
        ("ФЛАСК", "Языки программирования"),
        ("ДЖАВА", "Языки программирования"),
        ("СИШАРП", "Языки программирования"),
        ("РУБИ", "Языки программирования"),
        ("ГОЛАНГ", "Языки программирования"),
        ("РАСТ", "Языки программирования"),
        ("ДЖАВАСКРИПТ", "Языки программирования"),
        ("СВИФТ", "Языки программирования"),
        ("КОТЛИН", "Языки программирования"),

        ("КОМПЬЮТЕР", "Техника"),
        ("НОУТБУК", "Техника"),
        ("КЛАВИАТУРА", "Техника"),
        ("МЫШКА", "Техника"),
        ("МОНИТОР", "Техника"),
        ("ПРОЦЕССОР", "Техника"),
        ("ВИДЕОКАРТА", "Техника"),
        ("МАТЕРИНСКАЯ", "Техника"),
        ("ОПЕРАТИВКА", "Техника"),
        ("ЖЕСТКИЙДИСК", "Техника"),
        ("РОУТЕР", "Техника"),
        ("СМАРТФОН", "Техника"),
        ("ПЛАНШЕТ", "Техника"),

        ("СОБАКА", "Животные"),
        ("КОШКА", "Животные"),
        ("ТИГР", "Животные"),
        ("ЛЕВ", "Животные"),
        ("СЛОН", "Животные"),
        ("ЖИРАФ", "Животные"),
        ("ЗЕБРА", "Животные"),
        ("ВОЛК", "Животные"),
        ("ЛИСА", "Животные"),
        ("МЕДВЕДЬ", "Животные"),
        ("ЗАЯЦ", "Животные"),
        ("ОБЕЗЬЯНА", "Животные"),
        ("КЕНГУРУ", "Животные"),
        ("ПАНДА", "Животные"),
        ("ДЕЛЬФИН", "Животные"),

        ("МОСКВА", "Города"),
        ("САНКТПЕТЕРБУРГ", "Города"),
        ("НОВОСИБИРСК", "Города"),
        ("ЕКАТЕРИНБУРГ", "Города"),
        ("КАЗАНЬ", "Города"),
        ("НИЖНИЙНОВГОРОД", "Города"),
        ("ЧЕЛЯБИНСК", "Города"),
        ("САМАРА", "Города"),
        ("ОМСК", "Города"),
        ("РОСТОВНАДОНУ", "Города"),
        ("УФА", "Города"),
        ("КРАСНОЯРСК", "Города"),
        ("ВОРОНЕЖ", "Города"),

        ("УЧИТЕЛЬ", "Профессии"),
        ("ВРАЧ", "Профессии"),
        ("ИНЖЕНЕР", "Профессии"),
        ("ПРОГРАММИСТ", "Профессии"),
        ("АРТИСТ", "Профессии"),
        ("АРХИТЕКТОР", "Профессии"),
        ("ЮРИСТ", "Профессии"),
        ("БУХГАЛТЕР", "Профессии"),
        ("ПОВАР", "Профессии"),
        ("ВОДИТЕЛЬ", "Профессии"),
        ("СТРОИТЕЛЬ", "Профессии"),
        ("ФОТОГРАФ", "Профессии"),
        ("ДИЗАЙНЕР", "Профессии"),

        ("ПИЦЦА", "Еда"),
        ("БУРГЕР", "Еда"),
        ("СУШИ", "Еда"),
        ("БОРЩ", "Еда"),
        ("ПЕЛЬМЕНИ", "Еда"),
        ("ОЛИВЬЕ", "Еда"),
        ("ШАШЛЫК", "Еда"),
        ("МОРОЖЕНОЕ", "Еда"),
        ("ШОКОЛАД", "Еда"),

        ("ФУТБОЛ", "Спорт"),
        ("БАСКЕТБОЛ", "Спорт"),
        ("ВОЛЕЙБОЛ", "Спорт"),
        ("ТЕННИС", "Спорт"),
        ("ХОККЕЙ", "Спорт"),
        ("ПЛАВАНИЕ", "Спорт"),
        ("ШАХМАТЫ", "Спорт"),
    ]

    # Вставка одной командой
    cursor.executemany("INSERT INTO nems (slovo, category) VALUES (?, ?)", words)
    conn.commit()


if __name__ == '__main__':
    create_db()